In [1]:
import pandas as pd

In [3]:
csv=pd.read_csv(r'C:\Users\HP P DTS\Desktop\Python Classes\DataSet\Product.csv')

In [4]:
csv

    Order ID   Product    Category  Amount       Date Country
0       1001    Carrot  Vegetables    4000  10-Nov-19     USA
1       1002  Broccoli  Vegetables    3000  12-Nov-19      UK
2       1003    Banana      Fruits    5000  08-Aug-19     IND
3       1004    Banana      Fruits    2000  07-Sep-19     GER
4       1005     Beans  Vegetables    5000  13-Jul-19     USA
5       1006    Orange      Fruits    1000  15-Aug-19      UK
6       1007  Broccoli  Vegetables    2000  10-Aug-19    FRNC
7       1008    Banana      Fruits    4000  15-Aug-19     IND
8       1009     Apple      Fruits    5000  14-Aug-19    FRNC
9       1010     Mango      Fruits    3000  01-Jul-19     USA
10      1011    Carrot  Vegetables    1000  10-Jul-19     USA
11      1012     Apple      Fruits    5000  08-Aug-19    FRNC
12      1013    Banana      Fruits    3000  05-Aug-19      UK
13      1014  Broccoli  Vegetables    2000  10-Nov-19     IND
14      1015    Carrot  Vegetables    4000  12-Nov-19    FRNC
15      1016     Mango      Fruits    5000  01-Sep-19      UK

In [5]:
# Row Selection - loc[] and iloc[]
# loc[] -> when the date index value is string
# iloc[]-> when the data index value is integer

In [15]:
csv[:][0:1]

   Order ID Product    Category  Amount       Date Country
0      1001  Carrot  Vegetables    4000  10-Nov-19     USA

In [17]:
csv.iloc[0]

Order ID          1001
Product         Carrot
Category    Vegetables
Amount            4000
Date         10-Nov-19
Country            USA
Name: 0, dtype: object

In [19]:
csv.iloc[0:4]

   Order ID   Product    Category  Amount       Date Country
0      1001    Carrot  Vegetables    4000  10-Nov-19     USA
1      1002  Broccoli  Vegetables    3000  12-Nov-19      UK
2      1003    Banana      Fruits    5000  08-Aug-19     IND
3      1004    Banana      Fruits    2000  07-Sep-19     GER

In [20]:
csv.iloc[0:4]['Amount']

0    4000
1    3000
2    5000
3    2000
Name: Amount, dtype: int64

In [21]:
comp={'Name':['Google','Microsoft','Oracle','IBM'],
     'Sal':[5000,4500,6000,3000],
     'Benefit':[5,10,11,2]}

In [22]:
comp_df=pd.DataFrame(comp)

In [24]:
comp_df

        Name   Sal  Benefit
0     Google  5000        5
1  Microsoft  4500       10
2     Oracle  6000       11
3        IBM  3000        2

In [25]:
country=['USA','UK','GER','RUSS']

In [26]:
comp_df['Cnt']=country

In [27]:
comp_df

        Name   Sal  Benefit   Cnt
0     Google  5000        5   USA
1  Microsoft  4500       10    UK
2     Oracle  6000       11   GER
3        IBM  3000        2  RUSS

In [28]:
comp_df.set_index(comp_df['Cnt'])

           Name   Sal  Benefit   Cnt
Cnt
USA      Google  5000        5   USA
UK    Microsoft  4500       10    UK
GER      Oracle  6000       11   GER
RUSS        IBM  3000        2  RUSS

In [29]:
comp_df

        Name   Sal  Benefit   Cnt
0     Google  5000        5   USA
1  Microsoft  4500       10    UK
2     Oracle  6000       11   GER
3        IBM  3000        2  RUSS

In [37]:
comp_df1=comp_df

In [38]:
comp_df1

           Name   Sal  Benefit   Cnt
USA      Google  5000        5   USA
UK    Microsoft  4500       10    UK
GER      Oracle  6000       11   GER
RUSS        IBM  3000        2  RUSS

In [36]:
comp_df1.loc['USA']

Name       Google
Sal          5000
Benefit         5
Cnt           USA
Name: USA, dtype: object

In [39]:
comp_df

           Name   Sal  Benefit   Cnt
USA      Google  5000        5   USA
UK    Microsoft  4500       10    UK
GER      Oracle  6000       11   GER
RUSS        IBM  3000        2  RUSS

In [41]:
comp_df1.iloc[0]

Name       Google
Sal          5000
Benefit         5
Cnt           USA
Name: USA, dtype: object

In [46]:
comp_df1.loc[['USA','UK']]

          Name   Sal  Benefit  Cnt
USA     Google  5000        5  USA
UK   Microsoft  4500       10   UK

In [49]:
comp_df1.loc['UK':]

           Name   Sal  Benefit   Cnt
UK    Microsoft  4500       10    UK
GER      Oracle  6000       11   GER
RUSS        IBM  3000        2  RUSS

In [52]:
comp_df1.loc['USA'::2]

       Name   Sal  Benefit  Cnt
USA  Google  5000        5  USA
GER  Oracle  6000       11  GER

In [53]:
comp_df1.loc['USA'::2]['Benefit']

USA     5
GER    11
Name: Benefit, dtype: int64

In [54]:
comp_df.reset_index()

  index       Name   Sal  Benefit   Cnt
0   USA     Google  5000        5   USA
1    UK  Microsoft  4500       10    UK
2   GER     Oracle  6000       11   GER
3  RUSS        IBM  3000        2  RUSS

In [55]:
comp={'Name':['Google','Microsoft','Oracle','IBM'],
     'Sal':[5000,4500,6000,3000],
     'Benefit':[5,10,11,2]}

In [93]:
comp1=pd.DataFrame(comp)

In [94]:
comp1

        Name   Sal  Benefit
0     Google  5000        5
1  Microsoft  4500       10
2     Oracle  6000       11
3        IBM  3000        2

In [59]:
comp1.index

RangeIndex(start=0, stop=4, step=1)

In [60]:
comp1.reset_index()

   index       Name   Sal  Benefit
0      0     Google  5000        5
1      1  Microsoft  4500       10
2      2     Oracle  6000       11
3      3        IBM  3000        2

In [61]:
comp1

        Name   Sal  Benefit
0     Google  5000        5
1  Microsoft  4500       10
2     Oracle  6000       11
3        IBM  3000        2

In [96]:
comp1.set_index(comp1['Benefit'],inplace=True)

In [97]:
comp1

              Name   Sal  Benefit
Benefit
5           Google  5000        5
10       Microsoft  4500       10
11          Oracle  6000       11
2              IBM  3000        2

In [91]:
comp1.reset_index()

ValueError: cannot insert Benefit, already exists

In [98]:
comp1

              Name   Sal  Benefit
Benefit
5           Google  5000        5
10       Microsoft  4500       10
11          Oracle  6000       11
2              IBM  3000        2

In [101]:
comp1[['Benefit','Sal']].values

array([[   5, 5000],
       [  10, 4500],
       [  11, 6000],
       [   2, 3000]], dtype=int64)

In [103]:
# Filteration
comp

{'Name': ['Google', 'Microsoft', 'Oracle', 'IBM'],
 'Sal': [5000, 4500, 6000, 3000],
 'Benefit': [5, 10, 11, 2]}

In [126]:
comp2=pd.DataFrame(comp)

In [115]:
comp2

        Name   Sal  Benefit
0     Google  5000        5
1  Microsoft  4500       10
2     Oracle  6000       11
3        IBM  3000        2

In [116]:
sal_6000=comp2==6000

In [117]:
sal_6000

    Name    Sal  Benefit
0  False  False    False
1  False  False    False
2  False   True    False
3  False  False    False

In [118]:
comp2[sal_6000]

  Name     Sal  Benefit
0  NaN     NaN      NaN
1  NaN     NaN      NaN
2  NaN  6000.0      NaN
3  NaN     NaN      NaN

In [119]:
comp2[comp2==6000]

  Name     Sal  Benefit
0  NaN     NaN      NaN
1  NaN     NaN      NaN
2  NaN  6000.0      NaN
3  NaN     NaN      NaN

In [120]:
# comperisional operations

In [121]:
comp2[comp2['Sal']<6000]

        Name   Sal  Benefit
0     Google  5000        5
1  Microsoft  4500       10
3        IBM  3000        2

In [122]:
comp2[comp2['Sal']<6000]['Benefit']

0     5
1    10
3     2
Name: Benefit, dtype: int64

In [123]:
comp2

        Name   Sal  Benefit
0     Google  5000        5
1  Microsoft  4500       10
2     Oracle  6000       11
3        IBM  3000        2

In [130]:
bl_val=comp2.iloc[1:]['Sal']==3000

In [133]:
bl_val

1    False
2    False
3     True
Name: Sal, dtype: bool

In [134]:
comp3=comp2.iloc[1:]

In [135]:
comp3

        Name   Sal  Benefit
1  Microsoft  4500       10
2     Oracle  6000       11
3        IBM  3000        2

In [136]:
comp3[bl_val]

  Name   Sal  Benefit
3  IBM  3000        2